app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 1], ["created_at", "2021-07-02 06:04:20.872132"], ["updated_at", "2021-07-02 06:04:20.872132"]]
---
  def follow(user_id)
    relationships.create(followed_id: user_id)

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow(user_id)
    relationships.find_by(followed_id: user_id).destroy